import React, { Component } from 'react'
import { Resolver } from './common/Resolver'
import './BlogContent.css'

const { Type } = Resolver

const init = [
  { type: Type.H1, content: '一级标题', anchor: '1' },
  { type: Type.H2, content: '二级标题', anchor: '2' },
  { type: Type.H3, content: '三级标题', anchor: '3' },
  { type: Type.P, content: '三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题三级标题', anchor: '3' },
  { type: Type.H2, content: '二级标题', anchor: '4' },
  { type: Type.P, content: '正文', anchor: '5' },
]

export class BlogContent extends Component {

  render () {
    return (
      <div className="BlogContent">
        {
          init.map(({ type, content, anchor }, index) =>
            <Resolver id={anchor} key={index} type={type} content={content}/>)
        }
      </div>
    )
  }
}